Tekla Open API Reference for Tekla Structures 2025
ComponentItem.Select Method (String, Int32)
 Selects the component item from the component database. Uses the type if defined for selection
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Select(
	string name,
	int number
)
Public Function Select (
	name As String,
	number As Integer
) As Boolean
Parameters
name
Type: System.String
The name of the component item to select.
number
Type: System.Int32
The number of the component item to select.
Return Value
Type: Boolean
True on success.
See Also
Reference
ComponentItem Class
Select Overload
Tekla.Structures.Catalogs Namespace